Revit 2024 API
DisplacementElement.IsElementDisplacedInView Method
 Indicates if the specified element displaced in the specified View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsElementDisplacedInView(
	View view,
	ElementId id
)
Visual Basic
Public Shared Function IsElementDisplacedInView ( _
	view As View, _
	id As ElementId _
) As Boolean
Visual C++
public:
static bool IsElementDisplacedInView(
	View^ view,
	ElementId^ id
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view.
id
Type: Autodesk.Revit.DB.ElementId
 The element id.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace